syms t;
h=[0:.001:1];
% x=3*t+10.5*t.^2-5.5*t.^3
x1=3*t*(1-t).^2+3*(t.^2)*(1-t)+3*(t.^3)
y1=2*3*t*(1-t)^2+3*t^2*(1-t)
x2=3*(1-4*t+6*t^2-4*t^3+t^4)+4*(4*t-12*t^2+12*t^3-4*t^4)+5*(6*t^2-12*t^3+6*t^4)+6*(4*t^3-4*t^4)+7*t^4
y2=-1*(4*t-12*t^2+12*t^3-4*t^4)-2*(6*t^2-12*t^3+6*t^4)+(4*t^3-4*t^4) 
x3=7*(1-t)^2+4*3*t*(1-t)^2+2*3*t^2*(1-t)
y3=-3*3*t*(1-t)^2-3*t^2*(1-t)
h1=plot(subs(x1,h),subs(y1,h),'r')
hold on
h2=plot(subs(x2,h),subs(y2,h),'g')
hold on
h3=plot(subs(x3,h),subs(y3,h),'b')
legend([h1,h2,h3],'第一个控制点集构造的贝塞尔曲线','第二个控制点集构造的贝塞尔曲线','第三个控制点集构造的贝塞尔曲线','Location','northeast')
xlabel('x')
ylabel('y')
